{ "translations": {
    "saving..." : "Speichere…",
    "saved!" : "Gespeichert!",
    "failed!" : "Fehlgeschlagen!",
    "Saved" : "Gespeichert",
    "There was a problem saving your changes. Click to resume editing." : "Es gab ein Problem beim Speichern deiner Änderungen. Klicken um zur Bearbeitung zurückzukehren.",
    "An error occurred!" : "Es ist ein Fehler aufgetreten!",
    "Edit" : "Bearbeiten",
    "Mixed" : "Gemischt",
    "Preview" : "Vorschau",
    "New text file" : "Neue Textdatei",
    "New text file.txt" : "Neue Textdatei file.txt",
    "You can not open a folder" : "Du kannst keinen Ordner öffnen",
    "This file is too big to be opened. Please download the file instead." : "Die Datei ist zu groß zum Öffnen. Bitte lade stattdessen die Datei herunter.",
    "Cannot read the file." : "Datei kann nicht gelesen werden.",
    "Invalid file path supplied." : "Ungültiger Dateipfad angegeben.",
    "The file is locked." : "Die Datei ist gesperrt.",
    "An internal server error occurred." : "Es ist ein interner Fehler aufgetreten.",
    "You can not write to a folder" : "Du kannst nicht in einen Ordner schreiben",
    "Cannot save file as it has been modified since opening" : "Die Datei konnte nicht gespeichert werden, weil sie seit dem Öffnen verändert worden ist",
    "Could not write to file." : "Konnte Datei nicht schreiben.",
    "Insufficient permissions" : "Nicht ausreichende Berechtigungen",
    "File path not supplied" : "Dateipfad nicht angegeben",
    "File mtime not supplied" : "Dateiänderungsdatum nicht angegeben",
    "Share not found" : "Freigabe nicht gefunden",
    "You are not authorized to open this share" : "Du darfst diese Freigabe nicht öffnen",
    "Invalid range request" : "Ungültige Bereichsanfrage",
    "Text editor" : "Text-Editor",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry in the New button at the top of the web browser the Text file entry appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Diese App ermöglicht es den Nextcloud-Nutzern, Textdateien im Browser zu öffnen, zu bearbeiten und zu speichern. Wenn aktiviert, wird oben im Dateimenü ein Erstellen-Button eingeblendet. Beim Klicken auf Erstellen wird eine neue Textdatei im Browser geöffnet, die bearbeitet und im aktuellen Nextcloud-Ordner gespeichert werden kann. Beim Klick auf eine Textdatei wird diese im Browser geöffnet. Sofern der Nutzer eine entsprechende Berechtigung hat, kann er die Datei auch bearbeiten und speichern.\nWeitere Informationen sind in der Text-Editor Dokumentation zu finden."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}