{ "translations": {
    "Saving …" : "Αποθήκευση…",
    "Saved!" : "Αποθηκεύτηκε!",
    "Failed!" : "Απέτυχε!",
    "Saved" : "Αποθηκεύτηκαν",
    "There was a problem saving your changes. Click to resume editing." : "Προέκυψε πρόβλημα κατά την αποθήκευση των αλλαγών σας. Κάντε κλικ για να συνεχίσετε την επεξεργασία.",
    "Edit in plain text editor" : "Επεξεργασία σε απλό επεξεργαστή κειμένου",
    "An error occurred!" : "Παρουσιάστηκε σφάλμα!",
    "Edit" : "Επεξεργασία",
    "Mixed" : "Μικτό",
    "Preview" : "Προεπισκόπηση",
    "New text file" : "Νέο αρχείο κειμένου",
    "New text file.txt" : "Νέο αρχείο κειμένου.txt",
    "You cannot open a folder" : "Δεν μπορείτε να ανοίξετε ένα φάκελο",
    "This file is too big to be opened. Please download the file instead." : "Αυτό το αρχείο είναι πολύ μεγάλο για να ανοιχθεί. Αντί αυτού, παρακαλούμε κάντε λήψη του αρχείου.",
    "Cannot read the file." : "Αδυναμία ανάγνωσης αρχείου.",
    "Invalid file path supplied." : "Έχει δοθεί άκυρη διαδρομή για το αρχείο.",
    "The file is locked." : "Το αρχείο είναι κλειδωμένο.",
    "An internal server error occurred." : "Προέκυψε ένα εσωτερικό σφάλμα διακομιστή.",
    "You cannot write to a folder." : "Δεν μπορείτε να γράψετε σε ένα φάκελο.",
    "Cannot save file as it has been modified since opening." : "Δεν είναι δυνατή η αποθήκευση του αρχείου καθώς έχει τροποποιηθεί από όταν ανοίχθηκε.",
    "Could not write to file." : "Αδυναμία εγγραφής σε αρχείο.",
    "Insufficient permissions." : "Ανεπαρκή δικαιώματα.",
    "File path not supplied." : "Δεν παρέχεται διαδρομή αρχείου.",
    "File mtime not supplied." : "Δεν παρέχεται χρόνος αρχείου.",
    "Share not found" : "Δεν βρέθηκε το κονόχρηστο",
    "You are not authorized to open this share" : "Δεν σας επιτρέπεται η πρόσβαση στοι κοινόχρηστο",
    "Invalid range request" : "Μή έγκυρο αίτημα",
    "Plain text editor" : "Απλός επεξεργαστής κειμένου",
    "Open, save and edit text files" : "Ανοίξτε, αποθηκεύστε και επεξεργαστείτε αρχεία κειμένου",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Η εφαρμογή επιτρέπει στους χρήστες του Nextcloud να ανοίγουν, να αποθηκεύουν και να επεξεργάζονται αρχεία κειμένου στο πρόγραμμα περιήγησης ιστού. Εάν είναι ενεργοποιημένη, εμφανίζεται μια καταχώρηση που ονομάζεται \"Αρχείο κειμένου\" στο μενού \"Νέο\" κουμπί στο επάνω μέρος του προγράμματος περιήγησης. Όταν κάνετε κλικ, ανοίγει ένα νέο αρχείο κειμένου στο πρόγραμμα περιήγησης και το αρχείο μπορεί να αποθηκευτεί στον τρέχοντα κατάλογο Nextcloud. Επιπλέον, όταν κάνετε κλικ σε ένα αρχείο κειμένου στο πρόγραμμα περιήγησης ιστού, θα ανοίξει προς επεξεργασία. Εάν επιτρέπεται, ο χρήστης μπορεί επίσης να επεξεργαστεί τα κοινόχρηστα αρχεία και να αποθηκεύσει αυτές τις αλλαγές ξανά στο πρόγραμμα περιήγησης ιστού.\nΠερισσότερες πληροφορίες είναι διαθέσιμες στην τεκμηρίωση του κειμένου επεξεργασίας."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}