{ "translations": {
    "Saving …" : "Konservado...",
    "Saved!" : "Konservita!",
    "Saved" : "Konservita",
    "There was a problem saving your changes. Click to resume editing." : "Problemo dum konservado de viaj ŝanĝoj. Alklaku por reaktivigi redakton.",
    "Edit in plain text editor" : "Modifi en plenteksta redaktilo",
    "An error occurred!" : "Eraro okazis!",
    "Edit" : "Redakti",
    "Mixed" : "Hibrida",
    "Preview" : "Antaŭvidi",
    "New text file" : "Nova tekstodosiero",
    "New text file.txt" : "Nova tekstodosiero.txt",
    "This file is too big to be opened. Please download the file instead." : "La dosiero tro grandas por malfermi. Bonvolu elŝuti la dosieron anstataŭe.",
    "Cannot read the file." : "Ne legeblas la dosiero.",
    "Invalid file path supplied." : "Nevalida dosiervojo provizita.",
    "The file is locked." : "La dosiero estas ŝlosa.",
    "An internal server error occurred." : "Ena servileraro okazis.",
    "Could not write to file." : "Ne povis skribi al dosiero.",
    "Share not found" : "Kunhavigo ne troviĝis",
    "You are not authorized to open this share" : "Vi ne permesatas malfermi ĉi tiun kunhavigon",
    "Invalid range request" : "Nevalida intervalopeto",
    "Plain text editor" : "Plenteksta redaktilo",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Per tiu aplikaĵo, uzantoj povas malfermi, konservi kaj modifi tekstodosierojn ene de la retumilo. Se oni ŝaltas ĝin, elemento nomita „Tekstodosiero“ en la menubutono „Nova“ supre aperas. Kiam oni alklakas ĝin, nova tekstodosiero malfermas en la retumilo kaj la dosiero konserveblas en la aktualan Nextcloud-dosierujon. Krome, kiam oni alklakas tekstodosieron en la retumilo, ĝi malfermos kaj estos modifeblos. Se la permesoj tion eblas, uzanto povas ankaŭ redakti kunhavigitajn dosierojn kaj konservi la ŝanĝojn.\nPliaj informoj disponeblas en la dokumentaro pri la teksta redaktilo."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}