{ "translations": {
    "Saving …" : "Saving …",
    "Saved!" : "¡Guardado!",
    "Failed!" : "¡Falló!",
    "Saved" : "Guardado",
    "There was a problem saving your changes. Click to resume editing." : "Se presentó un problema al guardar sus cambios. Por favor haz click para continuar editando.",
    "Edit in plain text editor" : "Editar en el editor de texto plano",
    "An error occurred!" : "¡Se presentó un error!",
    "Edit" : "Editar",
    "Mixed" : "Mixto",
    "Preview" : "Previsualizar",
    "New text file" : "Nuevo archivo de texto",
    "New text file.txt" : "Nuevo archivo de texto.txt",
    "You cannot open a folder" : "No puedes abrir una carpeta",
    "This file is too big to be opened. Please download the file instead." : "Este archivo es demasiado grande para ser abierto. Por favor descárgarlo en su lugar.",
    "Cannot read the file." : "No es posible leer el archivo.",
    "Invalid file path supplied." : "La ruta del archivo proporcionada es inválida.",
    "The file is locked." : "El archivo está bloqueado.",
    "An internal server error occurred." : "Se presentó un error interno en el servidor. ",
    "You cannot write to a folder." : "No puedes escribir en una carpeta.",
    "Cannot save file as it has been modified since opening." : "No se puede guardar el archivo porque ha sido modificado desde que se abrió.",
    "Could not write to file." : "No se pudo escribir en el archivo.",
    "Insufficient permissions." : "Permisos insuficientes.",
    "File path not supplied." : "No se proporcionó la ruta del archivo.",
    "File mtime not supplied." : "No se proporcionó la fecha de modificación del archivo.",
    "Share not found" : "No se encontró el elemento compartido",
    "You are not authorized to open this share" : "No estas autorizado para abrir este elemento compartido",
    "Invalid range request" : "Rango de solicitud invalido",
    "Plain text editor" : "Editor de texto plano",
    "Open, save and edit text files" : "Abrir, guardar y editar archivos de texto",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Esta aplicación permite a los usuarios de Nextcloud abrir, guardar y editar archivos de texto en el navegador web. Si está habilitada, aparecerá una entrada llamada \"Archivo de texto\" en el menú del botón \"Nuevo\" en la parte superior del navegador web. Al hacer clic en él, se abrirá un nuevo archivo de texto en el navegador y se podrá guardar en el directorio actual de Nextcloud. Además, cuando se haga clic en un archivo de texto en el navegador web, se abrirá y se podrá editar. Si los permisos lo permiten, un usuario también puede editar archivos compartidos y guardar los cambios de nuevo en el navegador web.\n      Más información está disponible en la documentación del editor de texto."
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}