{ "translations": {
    "saving..." : "guardando...",
    "saved!" : "¡Guardado!",
    "failed!" : "¡Se presentó una falla!",
    "Saved" : "Guardado",
    "There was a problem saving your changes. Click to resume editing." : "Se presentó un problema al guardar sus cambios. Por favor haz click para continuar editando.",
    "An error occurred!" : "¡Se presentó un error!",
    "Edit" : "Editar",
    "Mixed" : "Mixto",
    "Preview" : "Previsualizar",
    "New text file" : "Nuevo archivo de texto",
    "New text file.txt" : "Nuevo archivo de texto.txt",
    "You can not open a folder" : "No puedes abrir la carpeta",
    "This file is too big to be opened. Please download the file instead." : "Este archivo es demasiado grande para ser abierto. Por favor descárgarlo en su lugar.",
    "Cannot read the file." : "No es posible leer el archivo.",
    "Invalid file path supplied." : "La ruta del archivo proporcionada es inválida.",
    "The file is locked." : "El archivo está bloqueado.",
    "An internal server error occurred." : "Se presentó un error interno en el servidor. ",
    "You can not write to a folder" : "No puedes escribir a la carpeta",
    "Cannot save file as it has been modified since opening" : "No es posible guardar el archivo ya que ha sido modificado desde que fue abierto",
    "Insufficient permissions" : "Permisos insuficientes",
    "File path not supplied" : "La ruta del archivo no fue proporcionada",
    "File mtime not supplied" : "El archivo mtime no fue proporcionado",
    "Share not found" : "No se encontró el elemento compartido",
    "You are not authorized to open this share" : "No estas autorizado para abrir este elemento compartido",
    "Invalid range request" : "Rango de solicitud invalido",
    "Text editor" : "Editor de texto",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry in the New button at the top of the web browser the Text file entry appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Esta aplicación le permite a los usuarios de Nextcloud abrir, guardar y editar archivos de texto en el navegador web. Si se habilita, aparece el elemento de Texto en el botón Nuevo en la parte superior del navegador web. Al presionarlo, un nuevo archivo de texto se abre en el nabegador y el archivo puede ser guardado en el directorio actual de Nextcloud. Adicionalmente, cuando se hace click en un archivo desde el navegador, se abrirá y podrá ser editado. Si los privilegios lo permiten, un usuario tambien puede editar archivos compartidos y guardar estos cambiso de vuelta en el navegador. \nHay más información disponible en la documentación del editor de texto."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}