{ "translations": {
    "Saving …" : "Salvestamine …",
    "Saved!" : "Salvestatud!",
    "Failed!" : "Ei õnnestunud!",
    "Saved" : "Salvestatud",
    "There was a problem saving your changes. Click to resume editing." : "Sinu muudatuste salvestamisega tekkis viga. Kliki muutmise jätkamiseks.",
    "Edit in plain text editor" : "Muuda lihtsas tekstitoimetis",
    "An error occurred!" : "Tekis viga!",
    "Edit" : "Muuda",
    "Mixed" : "Segatud",
    "Preview" : "Eelvaade",
    "New text file" : "Uus tekstifail",
    "New text file.txt" : "Uus tekstifail.txt",
    "You cannot open a folder" : "Sa ei saa avada kausta",
    "This file is too big to be opened. Please download the file instead." : "See fail on avamiseks liiga suur. Selle asemel palun laadi fail alla.",
    "Cannot read the file." : "Faili lugemine ei õnnestu.",
    "Invalid file path supplied." : "Faili asukoht on vigane.",
    "The file is locked." : "Fail on lukus.",
    "An internal server error occurred." : "Tekkis sisemine serveri viga.",
    "You cannot write to a folder." : "Sa ei saa kirjutada kausta.",
    "Cannot save file as it has been modified since opening." : "Faili ei saa salvestada, kuna seda on pärast avamist muudetud.",
    "Could not write to file." : "Faili kirjutamine ei õnnestu.",
    "Insufficient permissions." : "Pole piisavalt õigusi.",
    "File path not supplied." : "Faili asukoht pole toetatud.",
    "File mtime not supplied." : "Faili mtime pole toetatud.",
    "Share not found" : "Jagamist ei leidu",
    "You are not authorized to open this share" : "Sul pole luba selle jagamise avamiseks",
    "Invalid range request" : "Vigane vahemikupäring",
    "Plain text editor" : "Lihtne tekstitoimeti",
    "Open, save and edit text files" : "Ava, salvesta ja muuda tekstifaile",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "See rakendus võimaldab Nextcloudi kasutajatel avada, salvestada ja muuta veebibrauseris tekstifaile. Kui on valik sisselülitatud, siis uus menüürida „Tekstifail“ tekib nupu „Uus“ alla veebilehe ülaossa. Selle klõpsimisel avaneb uus ja tühi tekstifail, mida saad salvestada antud Nextcloudi kausta. Olemasoleva tekstifaili klõpsimisel saad seda veebibrauseris muuta ja salvestada. Kui õigused võimaldavad, siis saad veebibrauseris ka muuta ja salvestada jagatud tekstifaile.\nLisateavet leiad tekstitoimeti kasutusjuhendist."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}