{ "translations": {
    "Saving …" : "Shábháil …",
    "Saved!" : "Shábháil!",
    "Failed!" : "Theip!",
    "Saved" : "Shábháil",
    "There was a problem saving your changes. Click to resume editing." : "Bhí fadhb ann do chuid athruithe a shábháil. Cliceáil chun an eagarthóireacht a atosú.",
    "Edit in plain text editor" : "Cuir in eagar i ngnáth-théacs eagarthóir",
    "An error occurred!" : "Tharla earráid!",
    "Edit" : "Cuir in eagar",
    "Mixed" : "Measctha",
    "Preview" : "Réamhamharc",
    "New text file" : "Comhad téacs nua",
    "New text file.txt" : "Comhad téacs nua.txt",
    "You cannot open a folder" : "Ní féidir leat fillteán a oscailt",
    "This file is too big to be opened. Please download the file instead." : "Tá an comhad seo ró-mhór le hoscailt. Íoslódáil an comhad ina ionad sin le do thoil.",
    "Cannot read the file." : "Ní féidir an comhad a léamh.",
    "Invalid file path supplied." : "Conair comhaid neamhbhailí soláthraithe.",
    "The file is locked." : "Tá an comhad faoi ghlas.",
    "An internal server error occurred." : "Tharla earráid freastalaí inmheánach.",
    "You cannot write to a folder." : "Ní féidir leat scríobh chuig fillteán.",
    "Cannot save file as it has been modified since opening." : "Ní féidir an comhad a shábháil mar tá sé athraithe ó osclaíodh é.",
    "Could not write to file." : "Níorbh fhéidir scríobh chuig an gcomhad.",
    "Insufficient permissions." : "Ceadanna neamhleor.",
    "File path not supplied." : "Conair an chomhaid gan soláthar.",
    "File mtime not supplied." : "Níor soláthraíodh an comhad mtime.",
    "Share not found" : "Ní bhfuarthas an sciar",
    "You are not authorized to open this share" : "Níl tú údaraithe an sciar seo a oscailt",
    "Invalid range request" : "Iarratas raon neamhbhailí",
    "Plain text editor" : "Eagarthóir téacs saor in aisce,",
    "Open, save and edit text files" : "Oscail, sábháil agus cuir in eagar comhaid téacs",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Cuireann an feidhmchlár seo ar chumas úsáideoirí Nextcloud comhaid téacs a oscailt, a shábháil agus a chur in eagar sa bhrabhsálaí gréasáin. Má tá sé cumasaithe, feictear iontráil ar a dtugtar \"Comhad téacs\" sa roghchlár cnaipe \"Nua\" ag barr an bhrabhsálaí gréasáin. Nuair a chliceáiltear é, osclaíonn comhad téacs nua sa bhrabhsálaí agus is féidir an comhad a shábháil ar an eolaire Nextcloud reatha. Ina theannta sin, nuair a chliceáiltear ar chomhad téacs sa bhrabhsálaí gréasáin, osclófar é agus beidh sé in eagar. Má cheadaíonn na pribhléidí, is féidir le húsáideoir comhaid roinnte a chur in eagar freisin agus na hathruithe seo a shábháil ar ais sa bhrabhsálaí gréasáin.\nTá tuilleadh eolais ar fáil i gcáipéisíocht an eagarthóra téacs."
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}