{ "translations": {
    "saving..." : "gardando...",
    "saved!" : "gardado!",
    "failed!" : "produciuse un fallo!",
    "Saved" : "Gardado",
    "There was a problem saving your changes. Click to resume editing." : "Xurdiu un problema ao gardar os cambios. Prema para retomar a edición.",
    "An error occurred!" : "Produciuse un erro!",
    "Edit" : "Editar",
    "Mixed" : "Mesturado",
    "Preview" : "Vista previa",
    "New text file" : "Novo ficheiro de texto",
    "New text file.txt" : "Novo ficheiro de texto ficheiro.txt",
    "You can not open a folder" : "Non se pode abrir o cartafol",
    "This file is too big to be opened. Please download the file instead." : "O ficheiro é grande de máis para ser aberto. Descargue o ficheiro no canto de abrilo.",
    "Cannot read the file." : "Non é posíbel ler o ficheiro.",
    "Invalid file path supplied." : "Forneceu unha ruta incorrecta.",
    "The file is locked." : "O ficheiro está bloqueado.",
    "An internal server error occurred." : "Produciuse un erro interno no servidor.",
    "You can not write to a folder" : "Non é posíbel escribir no cartafol",
    "Cannot save file as it has been modified since opening" : "Non é posíbel gardar o ficheiro, xa que foi modificado trala súa apertura",
    "Could not write to file." : "Non foi posíbel escribir no ficheiro",
    "Insufficient permissions" : "Non ten permisos abondo",
    "File path not supplied" : "Non forneceu unha ruta de ficheiro",
    "File mtime not supplied" : "Non forneceu o ficheiro mtime",
    "Share not found" : "Non se atopou o recurso compartido",
    "You are not authorized to open this share" : "Non está autorizado a abrir este recurso compartido",
    "Invalid range request" : "Solicitude de intervalo incorrecta",
    "Text editor" : "Editor de texto",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Este aplicativo permítelle aos usuarios de Nextcloud abrir, gardar e editar ficheiros de texto no navegador. Se está activada, aparece unha entrada «Ficheiro de texto» no botón «Novo» na parte superior do navegador. Ao premela, aparece un novo ficheiro de texto no navegador e o ficheiro gardarase no directorio actual do Nextcloud. Ademais, cando se preme nun ficheiro de texto no navegador, abrirase e poderá editarse. Se os permisos lle lo permiten, un usuario tamén pode editar ficheiros compartidos e gardar estes cambios no navegador.\nHai dispoñíbel máis información na documentación do editor de texto."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}