{ "translations": {
    "Saving …" : "Spremanje...",
    "Saved!" : "Spremljeno!",
    "Failed!" : "Neuspješno!",
    "Saved" : "Spremljeno",
    "There was a problem saving your changes. Click to resume editing." : "Došlo je do problema prilikom spremanja promjena. Kliknite za nastavak uređivanja.",
    "Edit in plain text editor" : "Uredi u uređivaču običnog teksta",
    "An error occurred!" : "Došlo je do pogreške!",
    "Edit" : "Uredi",
    "Mixed" : "Mješovito",
    "Preview" : "Pretpregled",
    "New text file" : "Nova tekstna datoteka",
    "New text file.txt" : "Nova tekstna datoteka.txt",
    "You cannot open a folder" : "Ne možete otvoriti mapu",
    "This file is too big to be opened. Please download the file instead." : "Ova je datoteka prevelika za otvaranje. Umjesto toga preuzmite datoteku.",
    "Cannot read the file." : "Datoteku nije moguće pročitati.",
    "Invalid file path supplied." : "Dostavljen nevažeći put datoteke.",
    "The file is locked." : "Datoteka je zaključana.",
    "An internal server error occurred." : "Došlo je do unutarnje pogreške poslužitelja.",
    "You cannot write to a folder." : "Ne možete pisati u mapu.",
    "Cannot save file as it has been modified since opening." : "Nije moguće spremiti datoteku jer je promijenjena nakon otvaranja.",
    "Could not write to file." : "Nije moguće pisati u datoteku.",
    "Insufficient permissions." : "Nedovoljna dopuštenja.",
    "File path not supplied." : "Nije isporučen put datoteke.",
    "File mtime not supplied." : "Nije isporučen mtime datoteke.",
    "Share not found" : "Dijeljenje nije pronađeno",
    "You are not authorized to open this share" : "Niste ovlašteni otvoriti ovo dijeljenje",
    "Invalid range request" : "Nevažeći zahtjev za rasponom",
    "Plain text editor" : "Uređivač običnog teksta",
    "Open, save and edit text files" : "Otvaranje, spremanje i uređivanje tekstnih datoteka",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Ova aplikacija omogućuje Nextcloudovim korisnicima otvaranje, spremanje i uređivanje tekstnih datoteka u web pregledniku. Ako je omogućena, prikazuje se unos pod nazivom „Tekstna datoteka” u izborniku gumba „Novo” pri vrhu web preglednika. Kada korisnik klikne na tu mogućnost u pregledniku se otvori nova tekstna datoteka koja se zatim može spremiti u trenutni Nextcloudov direktorij. Nadalje, kad se u web pregledniku klikne na tekstnu datoteku, ista će se otvoriti i moći uređivati. Ako korisnik ima dovoljne ovlasti, također može uređivati dijeljene datoteke i spremiti promjene natrag u web preglednik.\nViše informacija dostupno je u dokumentaciji uređivača teksta."
},"pluralForm" :"nplurals=3; plural=n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2;"
}