{ "translations": {
    "Saving …" : "Zapisywanie…",
    "Saved!" : "Zapisano!",
    "Failed!" : "Nie powiodło się!",
    "Saved" : "Zapisano",
    "There was a problem saving your changes. Click to resume editing." : "Podczas zapisywania zmian wystąpił problem. Kliknij, aby wznowić edycję.",
    "Edit in plain text editor" : "Edytuj w edytorze zwykłego tekstu",
    "An error occurred!" : "Wystąpił błąd!",
    "Edit" : "Edytuj",
    "Mixed" : "Różne",
    "Preview" : "Podgląd",
    "New text file" : "Nowy plik tekstowy",
    "New text file.txt" : "Nowy plik tekstowy.txt",
    "You cannot open a folder" : "Nie możesz otworzyć katalogu",
    "This file is too big to be opened. Please download the file instead." : "Plik jest zbyt duży, aby go otworzyć. Proszę pobrać plik.",
    "Cannot read the file." : "Nie można odczytać pliku.",
    "Invalid file path supplied." : "Podano nieprawidłową ścieżkę do pliku.",
    "The file is locked." : "Plik jest zablokowany.",
    "An internal server error occurred." : "Wystąpił wewnętrzny błąd serwera.",
    "You cannot write to a folder." : "Nie możesz zapisać do katalogu.",
    "Cannot save file as it has been modified since opening." : "Nie można zapisać pliku, ponieważ został zmodyfikowany od otwarcia.",
    "Could not write to file." : "Nie można zapisać pliku.",
    "Insufficient permissions." : "Niewystarczające uprawnienia.",
    "File path not supplied." : "Nie została podana ścieżka do pliku.",
    "File mtime not supplied." : "Plik mtime nie został podany.",
    "Share not found" : "Nie znaleziono udostępnienia",
    "You are not authorized to open this share" : "Nie masz uprawnień do otwarcia tego udostępnienia",
    "Invalid range request" : "Nieprawidłowe żądanie zakresu",
    "Plain text editor" : "Zwykły edytor tekstu",
    "Open, save and edit text files" : "Otwieraj, zapisuj i edytuj pliki tekstowe",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Aplikacja umożliwia użytkownikom Nextcloud otwieranie, zapisywanie i edytowanie plików tekstowych w przeglądarce internetowej. Po włączeniu, u góry przeglądarki pojawia się menu \"Plik tekstowy\" z opisem przycisku \"Nowy\" . Po kliknięciu nowy plik tekstowy otwiera się w przeglądarce, który można zapisać w bieżącym katalogu Nextcloud. Ponadto, po kliknięciu pliku tekstowego w przeglądarce internetowej, zostanie on otwarty i edytowany. Jeśli uprawnienia na to pozwalają, użytkownik może również edytować udostępnione pliki i zapisać te zmiany z powrotem w przeglądarce internetowej.\nWięcej informacji można znaleźć w dokumentacji edytora tekstu."
},"pluralForm" :"nplurals=4; plural=(n==1 ? 0 : (n%10>=2 && n%10<=4) && (n%100<12 || n%100>14) ? 1 : n!=1 && (n%10>=0 && n%10<=1) || (n%10>=5 && n%10<=9) || (n%100>=12 && n%100<=14) ? 2 : 3);"
}