{ "translations": {
    "saving..." : "чувам...",
    "saved!" : "сачувано!",
    "failed!" : "неуспех!",
    "Saved" : "Сачувано",
    "There was a problem saving your changes. Click to resume editing." : "Десио се проблем приликом уписа ваших измена. Кликните за наставак уређивања.",
    "An error occurred!" : "Дошло је до грешке!",
    "Edit" : "Измени",
    "Mixed" : "Мешано",
    "Preview" : "Преглед",
    "New text file" : "Нови текстуални фајл",
    "New text file.txt" : "Нов текстуални фајл.txt",
    "You can not open a folder" : "Не можете да отворите фасциклу",
    "This file is too big to be opened. Please download the file instead." : "Фајл је превелик за отварање. Преузмите га уместо отварања.",
    "Cannot read the file." : "Не могу да прочитам фајл.",
    "Invalid file path supplied." : "Дата је неисправна путања фајла.",
    "The file is locked." : "Фајл је закључан.",
    "An internal server error occurred." : "Десила се интерна грешка.",
    "You can not write to a folder" : "Не можете да уписујете у фасциклу",
    "Cannot save file as it has been modified since opening" : "Не могу да сачувам фајл јер је измењен откако је отворен",
    "Could not write to file." : "Не могу да пишем у фајл.",
    "Insufficient permissions" : "Недовољне дозволе",
    "File path not supplied" : "Није добијена путања фајла",
    "File mtime not supplied" : "Није добијено време измене фајла",
    "Share not found" : "Дељење није нађено",
    "You are not authorized to open this share" : "Нисте овлашћени да отворите ово дељење",
    "Invalid range request" : "Неисправан захтев опсега",
    "Text editor" : "Уређивач текста",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry in the New button at the top of the web browser the Text file entry appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Ова апликација омогућава корисницима Некстклауда да отварају, снимају и мењају текстуалне фајлове у веб читачу. Када се укључи, појављује се \"Текстуални фајл\" ставка у дугмету \"Нови\" на врху веб стране. Кликом на ову ставку се у веб читачу отвара нови текстуални фајл и фајл се може сачувати у тренутном Некстклауд директоријуму. Такође, кликом на овај фајл се он отвара у веб читачу и може да се даље уређује. Ако то привилегије дозвољавају, корисник такође може уређивати и дељене фајлове и снимати ове измене исто из веб читача.\nВише информација је доступно у докумнетацији уређивача текста."
},"pluralForm" :"nplurals=3; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2);"
}