{ "translations": {
    "Saving …" : "Sparar …",
    "Saved!" : "Sparad!",
    "Failed!" : "Misslyckades!",
    "Saved" : "Sparad",
    "There was a problem saving your changes. Click to resume editing." : "Ett problem uppstod med att spara dina ändringar. Klicka för att fortsätta redigera.",
    "Edit in plain text editor" : "Redigera i vanlig textredigerare",
    "An error occurred!" : "Ett fel uppstod!",
    "Edit" : "Redigera",
    "Mixed" : "Blandad",
    "Preview" : "Förhandsgranskning",
    "New text file" : "Ny textfil",
    "New text file.txt" : "Ny textfil.txt",
    "You cannot open a folder" : "Du kan inte öppna en mapp",
    "This file is too big to be opened. Please download the file instead." : "Denna fil är för stor för att öppnas. Vänligen ladda ner filen istället.",
    "Cannot read the file." : "Kan inte läsa fil.",
    "Invalid file path supplied." : "Felaktig sökväg till fil angavs.",
    "The file is locked." : "Filen är låst.",
    "An internal server error occurred." : "Ett internt serverfel uppstod.",
    "You cannot write to a folder." : "Du kan inte skriva till en mapp.",
    "Cannot save file as it has been modified since opening." : "Kan inte spara filen eftersom den har modifierats sedan den öppnats.",
    "Could not write to file." : "Kunde inte skriva till fil.",
    "Insufficient permissions." : "Otillräcklig behörighet.",
    "File path not supplied." : "Filens sökväg ej angiven.",
    "File mtime not supplied." : "Inget mtime-attribut angivet för filen.",
    "Share not found" : "Delningen hittades inte",
    "You are not authorized to open this share" : "Du har inte behörighet att öppna denna delning",
    "Invalid range request" : "Ogiltigt område för begäran",
    "Plain text editor" : "Enkel textredigerare",
    "Open, save and edit text files" : "Öppna, spara och redigera textfiler",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Applikationen ger en Nextcloud-användare möjligheten att öppna, spara och redigera textfiler i webbläsaren. Om applikationen är aktiverat visas, i webbläsarens ovankant,  ett val benämnt \"Textfil\" i menyn för knappen Ny. Vid klick öppnas en ny textfil i webbläsaren. Filen kan sedan sparas i den aktiva Nextcloud-mappen. Om en befintlig textfil klickas kommer den att öppnas och redigeras. Om tillräcklig behörighet finns kan en användare också redigera delade filer och spara dem i webbläsaren.\nYtterligare information finns i editorns dokumentation."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}