{ "translations": {
    "saving..." : "kaydediliyor...",
    "saved!" : "kaydedildi!",
    "failed!" : "kaydedilemedi!",
    "Saved" : "Kaydedildi",
    "There was a problem saving your changes. Click to resume editing." : "Değişiklikleriniz kaydedilirken bir sorun çıktı. Düzenlemeye geri dönmek için tıklayın.",
    "An error occurred!" : "Bir sorun çıktı!",
    "Edit" : "Düzenle",
    "Mixed" : "Karışık",
    "Preview" : "Önizleme",
    "New text file" : "Yeni metin dosyası",
    "New text file.txt" : "Yeni metin dosyası.txt",
    "You can not open a folder" : "Bir klasör açamazsınız",
    "This file is too big to be opened. Please download the file instead." : "Bu dosya açmak için çok büyük. Bunun yerine lütfen dosyayı indirin.",
    "Cannot read the file." : "Dosya okunamadı.",
    "Invalid file path supplied." : "Belirtilen dosya yolu geçersiz.",
    "The file is locked." : "Dosya kilitli.",
    "An internal server error occurred." : "Sunucu içinde bir sorun çıktı.",
    "You can not write to a folder" : "Bir klasöre yazamazsınız",
    "Cannot save file as it has been modified since opening" : "Dosya açıldıktan sonra değiştirildiği için kaydedilemedi",
    "Could not write to file." : "Dosyaya yazılamadı.",
    "Insufficient permissions" : "İzinler yetersiz",
    "File path not supplied" : "Dosya yolu belirtilmemiş",
    "File mtime not supplied" : "Dosya mtime belirtilmemiş",
    "Share not found" : "Paylaşım bulunamadı",
    "You are not authorized to open this share" : "Bu paylaşımı açma izniniz yok",
    "Invalid range request" : "Aralık isteği geçersiz",
    "Text editor" : "Metin düzenleyici",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry in the New button at the top of the web browser the Text file entry appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Bu uygulama, Nextcloud kullanıcılarının metin dosyalarını web tarayıcı üzerinde açıp düzenleyebilmesini ve kaydetmesini sağlar. Etkinleştirildiğinde, web tarayıcısının üst bölümündeki Yeni düğmesine Metin dosyası seçeneği görüntülenir. Bu seçeneğe tıklandığında web tarayıcı içinde yeni bir metin dosyası açılır ve bu dosya geçerli Nextcloud klasörüne kaydedilebilir. Ayrıca web tarayıcı içinde bir metin dosyasına tıklandığında dosya açılarak düzenlenebilir. Yeterli izinleri olan bir kullanıcı paylaşılmış dosyaları da web tarayıcı üzerinde düzenleyip kaydedebilir.\nAyrıntılı bilgi almak için metin düzenleyici uygulamasının belgelerine bakabilirsiniz."
},"pluralForm" :"nplurals=2; plural=(n > 1);"
}