{ "translations": {
    "Saving …" : "Saving…",
    "Saved!" : "قۇتۇلدى!",
    "Failed!" : "مەغلۇب بولدى!",
    "Saved" : "ساقلاندى",
    "There was a problem saving your changes. Click to resume editing." : "ئۆزگەرتىشلىرىڭىزنى تېجەشتە مەسىلە كۆرۈلدى. تەھرىرلەشنى ئەسلىگە كەلتۈرۈش ئۈچۈن چېكىڭ.",
    "Edit in plain text editor" : "ئاددىي تېكىست تەھرىرلىگۈچتە تەھرىرلەڭ",
    "An error occurred!" : "خاتالىق كۆرۈلدى!",
    "Edit" : "تەھرىر",
    "Mixed" : "ئارىلاش",
    "Preview" : "ئالدىن كۆرۈش",
    "New text file" : "يېڭى تېكىست ھۆججىتى",
    "New text file.txt" : "يېڭى تېكىست ھۆججىتى. Txt",
    "You cannot open a folder" : "ھۆججەت قىسقۇچنى ئاچالمايسىز",
    "This file is too big to be opened. Please download the file instead." : "بۇ ھۆججەتنى ئاچقىلى بەك چوڭ. ئۇنىڭ ئورنىغا ھۆججەتنى چۈشۈرۈڭ.",
    "Cannot read the file." : "ھۆججەتنى ئوقۇيالمايدۇ.",
    "Invalid file path supplied." : "تەمىنلەنگەن ئىناۋەتسىز ھۆججەت يولى.",
    "The file is locked." : "ھۆججەت قۇلۇپلاندى.",
    "An internal server error occurred." : "ئىچكى مۇلازىمېتىردا خاتالىق كۆرۈلدى.",
    "You cannot write to a folder." : "قىسقۇچقا خەت يازالمايسىز.",
    "Cannot save file as it has been modified since opening." : "ئېچىلغاندىن بۇيان ئۆزگەرتىلگەن بولغاچقا ھۆججەتنى ساقلىغىلى بولمايدۇ.",
    "Could not write to file." : "ھۆججەتكە يازالمىدى.",
    "Insufficient permissions." : "ئىجازەت يېتەرلىك ئەمەس.",
    "File path not supplied." : "ھۆججەت يولى تەمىنلەنمىدى.",
    "File mtime not supplied." : "ھۆججەت mtime تەمىنلەنمىدى.",
    "Share not found" : "ھەمبەھىر تېپىلمىدى",
    "You are not authorized to open this share" : "بۇ ھەمبەھىرنى ئېچىش ھوقۇقىڭىز يوق",
    "Invalid range request" : "دائىرە تەلىپى ئىناۋەتسىز",
    "Plain text editor" : "تۈز تېكىست تەھرىرلىگۈچى",
    "Open, save and edit text files" : "تېكىست ھۆججەتلىرىنى ئېچىش ، ساقلاش ۋە تەھرىرلەش",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "بۇ پروگرامما Nextcloud ئىشلەتكۈچىلىرىنىڭ توركۆرگۈدە تېكىست ھۆججەتلىرىنى ئېچىش ، ساقلاش ۋە تەھرىرلەش ئىمكانىيىتىگە ئىگە قىلىدۇ. ئەگەر قوزغىتىلسا ، توركۆرگۈنىڭ ئۈستىدىكى «يېڭى» كۇنۇپكا تىزىملىكىدىكى «تېكىست ھۆججىتى» دەپ يېزىلغان تۈر كۆرۈنىدۇ. چەككەندە ، توركۆرگۈدە يېڭى تېكىست ھۆججىتى ئېچىلىدۇ ۋە ھۆججەتنى نۆۋەتتىكى Nextcloud مۇندەرىجىسىگە ساقلىغىلى بولىدۇ. ئۇنىڭدىن باشقا ، توركۆرگۈدە تېكىست ھۆججىتى چەككەندە ، ئۇ ئېچىلىدۇ ۋە تەھرىرلىنىدۇ. ئەگەر ئىمتىياز رۇخسەت قىلسا ، ئىشلەتكۈچى يەنە ئورتاق ھۆججەتلەرنى تەھرىرلىيەلەيدۇ ۋە بۇ ئۆزگەرتىشلەرنى توركۆرگۈگە ساقلىۋالىدۇ.\nتېخىمۇ كۆپ ئۇچۇرلار تېكىست تەھرىرلىگۈچ ھۆججىتىدە بار."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}