{ "translations": {
    "Saving …" : "Збереження …",
    "Saved!" : "Збережено!",
    "Failed!" : "Не вдалося!",
    "Saved" : "Збережено",
    "There was a problem saving your changes. Click to resume editing." : "Трапилася проблема при збереженні змін. Натисніть, щоб продовжити редагування.",
    "Edit in plain text editor" : "Редагувати у текстовому редакторі без форматування",
    "An error occurred!" : "Сталася помилка!",
    "Edit" : "Редагувати",
    "Mixed" : "Змішаний",
    "Preview" : "Перегляд",
    "New text file" : "Новий текстовий файл",
    "New text file.txt" : "Новий текстовий файл.txt",
    "You cannot open a folder" : "Неможливо відкрити каталог",
    "This file is too big to be opened. Please download the file instead." : "Файл занадто великий для відкриття. Будь ласка, завантажте файл замість цього.",
    "Cannot read the file." : "Не можливо прочитати файл.",
    "Invalid file path supplied." : "Помилковий шлях до файлу.",
    "The file is locked." : "Файл заблоковано.",
    "An internal server error occurred." : "Виникла внутрішня помилка серверу.",
    "You cannot write to a folder." : "Неможливо записати до каталогу",
    "Cannot save file as it has been modified since opening." : "Неможливо зберегти файл, оскільки його було змінено після відкриття.",
    "Could not write to file." : "Не вдалося записати до файлу.",
    "Insufficient permissions." : "Недостатньо прав.",
    "File path not supplied." : "Шлях до файлу не зазначено.",
    "File mtime not supplied." : "Не зазначено час зміни файлу",
    "Share not found" : "Спільний ресурс не знайдено",
    "You are not authorized to open this share" : "Недостатньо прав для доступу до спільного ресурсу",
    "Invalid range request" : "Недійсний діапазон запиту",
    "Plain text editor" : "Редактор текстів без форматування",
    "Open, save and edit text files" : "Відкривати, зберігати та редагувати текстові файли",
    "This application enables Nextcloud users to open, save and edit text files in the web browser. If enabled, an entry called \"Text file\" in the \"New\" button menu at the top of the web browser appears. When clicked, a new text file opens in the browser and the file can be saved into the current Nextcloud directory. Further, when a text file is clicked in the web browser, it will be opened and editable. If the privileges allow, a user can also edit shared files and save these changes back into the web browser.\nMore information is available in the text editor documentation." : "Цей застосунок дозволяє користувачам Nextcloud відкривати, зберігати та редагувати текстові файли у веб-браузері. Якщо його увімкнено, з'являється пункт \"Текстовий файл\" у меню кнопки \"Створити\" у верхній частині веб-браузера. При натисканні на нього в браузері відкривається новий текстовий файл, який можна зберегти в поточну директорію Nextcloud. Надалі, при натисканні на текстовий файл у веб-браузері, він буде відкриватися і редагуватися. Якщо дозволяють привілеї, користувач також може редагувати спільні файли та зберігати ці зміни назад у веб-браузері.\nБільш детальна інформація доступна в документації до текстового редактора."
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);"
}